// 2. Даны два числа. Показать большее и меньшее число

int A = 3;
int B = 7;
double n = 0.5;

if (A>B)
{
    Console.WriteLine(A+" больше "+B);
}
else
{
    Console.WriteLine(A+" меньше "+B);
}